Revit 2027 API
DividedPath.IsValidBeginningIndent Method
 Checks that the indent value does not cause the beginningIndent and endIndent to overlop
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsValidBeginningIndent(
	double beginningIndent
)
Public Function IsValidBeginningIndent (
	beginningIndent As Double
) As Boolean
public:
bool IsValidBeginningIndent(
	double beginningIndent
)
member IsValidBeginningIndent :
        beginningIndent : float -> bool
Parameters
beginningIndent Double
Return Value
Boolean
See Also
Reference
DividedPath Class
Autodesk.Revit.DB Namespace